avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
/**
 * \file
 *
 * \brief Example application for the RF4CE and QMatrix integration for ATMega128RFA1 on AVR477 board.
 *
 * Copyright (c) 2011-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 */

/**
 * \mainpage
 *
 * \section intro Introduction
 * AVR477 is a Unique reference design with true integration of RF, Touch & MEMS

 * \section Connection Connection Aspects
 * \image html FlowDiagram.jpg

 * \section Sections Sections
 * - AVR477 Remote : This page provides firmware details of the AVR477 Remote.
 * - AVR477 Target : This page provides firmware details of the AVR477 Target.
 *                   The Target application can be run on the STB-RCB128RFA1  
 *                   board or the RZ600-RF231 board.     
 *
 * \section deviceinfo Device Info
 * This application is targeted for the ATmega128RFA1 MCU on the AVR477 Touch 
 * Remote Control board.\n
 * For the Demo scenario,a Target application that sends QDebug Data,received over air,
 * to QTouch Studio is used.\nThis Target Application can be run on the ATUC3A3256S MCU 
 * RZ600 board or on the ATmega128RFA1 MCU on the Sensor Terminal Board,when used along
 * with the QT600.
 *  
 * \section compinfo Compilation Info
 * This software was written for the GNU GCC,IAR for AVR,IAR for AVR32.\n
 * Supported Versions : AVR Studio 4,AVR Studio 5,IAR for AVR 6.10,IAR for AVR32 4.10 or higher.\n 
 * Other compilers may or may not work.
 *
 * \section contactinfo Contact Information
 * For further information, visit
 * <A href="http://www.microchip.com/design-centers/8-bit">Atmel AVR</A>.\n
 * Support and FAQ: https://www.microchip.com/support/
 */
/**
 * \page Rem AVR477 Remote
 
 * \section intro Introduction
 * AVR477 Remote Application showcases the capabilities of the AVR477 Touch Remote Control.

 * \section Arch Software Architecture
 * \image html SWArchitecture.jpg
 * \section HW Hardware
 *  AVR477 Remote Control Board
 * \image html Remote.jpg
 
 * \section desc Description 
 * The Remote Application transfers measured touch data over air as RF4CE packets.\n 
 * The AVR477 Remote control has periodic sleep functionality and wake-up based on Proximity Sensing implemented.\n
 * Back-lit LEDs and a Buzzer are available for indications.\n
 * A 3D Accelerometer is available for 3D position sensing.\n
 * Warm Reset functionality is implemented,which allows for retaining RF4CE Network Related 
 * parameters(Network Information Base) on the occurence of power failures.\n
 * Over-the-Air Firmware upgrade feature has been implemented.
 *
 * \defgroup RApp_API Remote Application related API's
 * \defgroup QTouch QTouch related API's
 * ZRC profile related
 * \defgroup apiRF4CONTROL_ZRC_CONSTANTS RF4CE ZRC constants
 * \defgroup apiRF4Control_ZRC_API RF4CE ZRC APIs
 * \defgroup apiRF4Control_ZRC_CMD_DISC_API RF4CE ZRC command discovery APIs
 * RF4CE Network related
 * \defgroup apiRF4CONTROL_NWK_CONSTANTS RF4CE Network constants
 * \defgroup apiRF4CONTROL_NWK_API RF4CE Network API
 * \defgroup apiRF4CONTROL_GENERIC_API RF4CE Generic API

 * QMatrix APIs
 * \defgroup QMatrix QMatrix related Configuration
 */

/*----------------------------------------------------------------------------
include files
----------------------------------------------------------------------------*/
/* RF4CE */
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include "pal.h"
#include "app_config.h"
#include "rf4ce.h"
#include "zrc.h"
#include "pb_pairing.h"
#include "vendor_data.h"
#include "compiler.h"

#if defined(__ICCAVR__)
#include "ioavr.h"              
#include "inavr.h"
#elif defined(__GNUC__)
#include "avr/io.h"    
#include <avr/interrupt.h>
#endif

#include "avrtypes.h"

#include "touch_api.h"

#ifdef _DEBUG_INTERFACE_
#include "qdebug.h"
#include "qdebug_transport.h"
#endif/* _DEBUG_INTERFACE_*/

#ifdef _PROX_
#include "t10_prox.h"
#endif /*Proximity Sensor*/

#ifdef _ACCELERO_
#include "kxtf9_driver.h"
#endif /*_ACCELERO*/

#include "memorymap.h"

/*----------------------------------------------------------------------------
manifest constants
----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
type definitions
----------------------------------------------------------------------------*/
/* RF4CE node states */
typedef enum node_status_tag
{
    IDLE,
    WARM_START,
    COLD_START,
    TRANSMITTING,
    RESET,

#ifdef _ENABLE_SLEEP_
    TRX_OFF_START,
    TRX_OFF_CONFIRM,
    TRX_ON_START
#endif /* _ENABLE_SLEEP_ */

} SHORTENUM node_status_t;

/*----------------------------------------------------------------------------
macros
----------------------------------------------------------------------------*/
#define QT_MEASUREMENT_PERIOD_MSEC   15u 

