avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
#ifdef _ENABLE_SLEEP_
#define AVR477_SLEEP_DURATION_IN_US ( AVR477_SLEEP_DURATION_SEC * 1000000u )
#define AVR477_ACTIVE_DURATION_IN_QT_MEASURE_PERIOD  (AVR477_ACTIVE_DURATION_SEC * 1000 / QT_MEASUREMENT_PERIOD_MSEC)
#endif /* _ENABLE_SLEEP_ */

#ifdef _ENABLE_WARM_RESET_
#define AVR477_WARM_RESET_WAIT_DURATION_IN_US ( AVR477_WARM_RESET_WAIT_TIME_SEC * 1000000u )
#endif /* _ENABLE_WARM_RESET_ */

#define ACCELERO_SIG_REF_DEFAULT (30u)

#define __delay_cycles(n)     __builtin_avr_delay_cycles(n)
#define __enable_interrupt()  sei()

/*----------------------------------------------------------------------------
prototypes
----------------------------------------------------------------------------*/
/* initialise host app, pins, watchdog, etc */
static void init_system( void );
/* configure timer ISR to fire regularly */
static void init_timer_isr( void );
/* Assign the parameters values to global configuration parameter structure */
static void qt_set_parameters( void );
/* Configure the Burst Length*/
static void burst_len_config( void );

/* Configure the buzzer */
static void buzzer_init(void);

/* LED Control */
static inline void led0_on(void);
static inline void led1_on(void);
static inline void led0_off(void);
static inline void led1_off(void);
static inline void led0_toggle(void);
static inline void led1_toggle(void);


/* qt filter callback function */ 
static void qt_avr477_filter_cb(void);

static void app_task(void);
static void extended_delay_ms(uint16_t delay_ms);
static void indicate_fault_behavior(void);

#ifdef _ENABLE_WARM_RESET_
static void start_warm_reset_cb(void *callback_parameter);
#endif /* _ENABLE_WARM_RESET_ */

#ifdef _ENABLE_SLEEP_
static void start_awake_timer_cb(void *callback_parameter);
static void sleep_led_control(void);
#endif /* _ENABLE_SLEEP_ */

#ifdef ZRC_CMD_DISCOVERY
static void start_cmd_disc_cb(void *callback_parameter);
#endif

static void buzzer_control(void);
static void config_sensors(void);




/* === GLOBALS ============================================================= */

FLASH_DECLARE(uint16_t VendorIdentifier) = (uint16_t)NWKC_VENDOR_IDENTIFIER;
FLASH_DECLARE(uint8_t vendor_string[7]) = NWKC_VENDOR_STRING;
FLASH_DECLARE(uint8_t app_user_string[15]) = APP_USER_STRING;
FLASH_DECLARE(uint8_t supported_cec_cmds[32]) = SUPPORTED_CEC_CMDS;

static node_status_t node_status;
static uint8_t pairing_ref = 0xFF;

#ifdef _ENABLE_SLEEP_
extern uint8_t allow_to_sleep;
static uint16_t enable_sleep_counter = 0;
#endif /* _ENABLE_SLEEP_ */

extern uint16_t  delivery;
extern uint16_t  qgSubsOnce;
extern uint16_t  qgSubsChange;
extern uint16_t  qgSubsAllways;

/* filter for channel signals */
static uint16_t filter[QT_NUM_CHANNELS][8];

/* Timer period in msec. */
uint16_t qt_measurement_period_msec = QT_MEASUREMENT_PERIOD_MSEC;

static uint16_t status_flag = 0u;
static uint16_t burst_flag = 0u;

/* flag set by timer ISR when it's time to measure touch */
static volatile uint8_t time_to_measure_touch = 0u;
/* current time, set by timer ISR */
volatile uint16_t current_time_ms_touch = 0u;

/*----------------------------------------------------------------------------
global variables
----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
extern variables
----------------------------------------------------------------------------*/
/* This configuration data structure parameters if needs to be changed will be
changed in the qt_set_parameters function */
extern qt_touch_lib_config_data_t qt_config_data;

#ifdef _QMATRIX_
//extern y_line_info_t y_line_info[NUM_Y_LINES];
//extern x_line_info_t x_line_info[NUM_X_LINES];

extern y_line_info_t ya_line_info[NUM_Y_LINES];
extern y_line_info_t yb_line_info[NUM_Y_LINES];
extern x_line_info_t x_line_info[NUM_X_LINES];

/* Fill out the X-Line masks on the X- Port selected.
* The order of X - Line numbering follows from the way the
* X-Lines are filled as below.
* Here, X0,X1,X2,X3,X4,X5,X6,X7 are on port-pin specified.
* 1 - if to specify if X line is on PORT_X_1,pin on the same selected port.
* 2 - if to specify if X line is on PORT_X_2,pin on the same selected port.
* 3 - if to specify if X line is on PORT_X_3,pin on the same selected port.
*
* Note: 1. The Number entries should be based on NUM_X_LINES
*          4 entries when NUM_X_LINES =4 and
*          8 entries when NUM_X_LINES=8
*/

x_line_info_t x_line_info[NUM_X_LINES]= {
FILL_OUT_X_LINE_INFO(1,6),
FILL_OUT_X_LINE_INFO(2,4),
FILL_OUT_X_LINE_INFO(2,5),
FILL_OUT_X_LINE_INFO(2,6),
FILL_OUT_X_LINE_INFO(2,7)
};

/* Fill out the Y-Line masks on the Y- Line port selected
 * The order of Y - Line numbering follows from the way the
 * Y-Lines are filled as below
 * Here, Y0,Y1,Y2,Y3 on 0,1,2,3
 * Note: 1. The Number entries should be based on NUM_X_LINES
 *          2 entries when NUM_Y_LINES=2
 *          4 entries when NUM_Y_LINES=4
 *          8 entries when NUM_Y_LINES=8
*/
y_line_info_t ya_line_info[NUM_Y_LINES]= {
    FILL_OUT_YA_LINE_INFO(  0u ),
    FILL_OUT_YA_LINE_INFO(  1u ),
    FILL_OUT_YA_LINE_INFO(  2u ),
    FILL_OUT_YA_LINE_INFO(  3u ),
};
y_line_info_t yb_line_info[NUM_Y_LINES]= {
    FILL_OUT_YB_LINE_INFO(  0u ),
    FILL_OUT_YB_LINE_INFO(  1u ),
    FILL_OUT_YB_LINE_INFO(  2u ),
    FILL_OUT_YB_LINE_INFO(  3u ),
};
#endif/*_QMATRIX_*/

#ifdef _ENABLE_SLEEP_
/**
 * @brief This function controls the LED in a definitive fashion before going to sleep.
 * @ingroup RApp_API
 */

static void sleep_led_control(void)
{
    for (uint8_t l = 0; l < 3; l++)
    {
        led0_on();
        led1_off();
        extended_delay_ms(100);
        led0_off();
        led1_on();
        extended_delay_ms(100);         
    }
    led0_off();
    led1_off();
    extended_delay_ms(200);
}
#endif /* _ENABLE_SLEEP_ */

/**
 * @brief This function is called every time the qt measuremement is done.
 * This is the pointer to callback function called before processing the signal 
 * @ingroup QTouch
 *
 */
static void qt_avr477_filter_cb(void)
{    
    uint8_t i;

