avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
    /* filter channel signals - averaging 6 samples */
    for( i = 0u; i < QT_NUM_CHANNELS; i++ )
   {
    filter[i][0] = filter[i][1];
    filter[i][1] = filter[i][2];
    filter[i][2] = filter[i][3];
    filter[i][3] = filter[i][4];
    filter[i][4] = filter[i][5];
    filter[i][5] = qt_measure_data.channel_signals[i];
    qt_measure_data.channel_signals[i] = ( ( filter[i][0] +
                                             filter[i][1] +
                                             filter[i][2] +
                                             filter[i][3] +
                                             filter[i][4] +
                                             filter[i][5] ) / 6u );
    }

#ifdef _ACCELERO_

    /* Set references for accelero (dummy channels) */
    qt_measure_data.channel_references[4]  = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_references[20] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_references[24] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_references[25] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_references[26] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_references[27] = ACCELERO_SIG_REF_DEFAULT;

    /* Set signals for accelero (dummy channels) */
    qt_measure_data.channel_signals[4]  = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_signals[20] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_signals[24] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_signals[25] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_signals[26] = ACCELERO_SIG_REF_DEFAULT;
    qt_measure_data.channel_signals[27] = ACCELERO_SIG_REF_DEFAULT;
    
    switch (memory_map.body.accelero_status)
    {
        case CTRL_REG2_FUM: /* Face up state mask */
        {
            qt_measure_data.channel_signals[4] = 10;
            break;
        }
        case CTRL_REG2_FDM: /* Face down state mask */
        {
            qt_measure_data.channel_signals[20] = 10;
            break;
        }
        case CTRL_REG2_UPM: /* Up state mask */
        {
            qt_measure_data.channel_signals[24] = 10;
            break;
        }
        case CTRL_REG2_DOM: /* Down state mask */
        {
            qt_measure_data.channel_signals[25] = 10;
            break;
        }
        case CTRL_REG2_RIM: /* Right state mask */
        {
            qt_measure_data.channel_signals[26] = 10;
            break;
        }
        case CTRL_REG2_LEM: /* Left state mask */
        {
            qt_measure_data.channel_signals[27] = 10;
            break;
        }
    }
#else
    {
      return;
    }
#endif
}

/**
 * @brief Main function - Initialization of RF4CE and QTouch are done. 
 * Then app_task() and nwk_task() is called in a loop.
 * @ingroup RApp_API
 */
int main( void )
{

    if (nwk_init() != NWK_SUCCESS)
    {
        /* something went wrong during initialization */
        while (1)
        {
            indicate_fault_behavior();
        }
    }

    /*
     * The stack is initialized above,
     * hence the global interrupts are enabled here.
     */    
    pal_global_irq_enable();

    init_timer_isr();
    
    /* initialise host app, pins, watchdog, etc */
    init_system();
    
    /*Configure Burst Length*/
    burst_len_config();
    config_sensors();

    /* Initialise and set touch params */
    qt_init_sensing();
    qt_set_parameters();
    buzzer_init();

    /*  Address to pass address of user functions   */
    /*  This function is called after the library has made capacitive measurements,
    *   but before it has processed them. The user can use this hook to apply filter
    *   functions to the measured signal values.(Possibly to fix sensor layout faults)    */
    /* This function is also used to send signal values to simulate Accelero meter,
       Just for demo purpose */
    qt_filter_callback = qt_avr477_filter_cb; 

    /* Initialize debug protocol */
#ifdef _DEBUG_INTERFACE_
    QDebug_Init();
#endif/* _DEBUG_INTERFACE_*/

#ifdef _PROX_
prox_init();
#endif/* _PROX_ */

 #ifdef _ACCELERO_
 accelero_init();
#endif /*_ACCELERO_ */

    /* Node status is set to Reset to start pairing or warm reset */
    node_status = RESET;

#ifdef _ENABLE_WARM_RESET_
    /* A Timer is started. If within this timeout cold-reset is not done,
       then warm start will be performed */
    pal_timer_start(T_LED_TIMER,
                    AVR477_WARM_RESET_WAIT_DURATION_IN_US,
                    TIMEOUT_RELATIVE,
                    (FUNC_PTR)start_warm_reset_cb,
                    NULL);
#endif /* _ENABLE_WARM_RESET_ */

    while (1)
    {
        app_task(); /* Application task */
        nwk_task(); /* RF4CE network layer task */
    }
}

/**
 * @brief This will fill the default threshold values in the configuration
 * data structure.But User can change the values of these parameters . This is
 * used to initialize the configuration data for processing.
 * @ingroup QTouch
 */
static void qt_set_parameters( void )
{
   qt_config_data.qt_di              = DEF_QT_DI;
   qt_config_data.qt_neg_drift_rate  = DEF_QT_NEG_DRIFT_RATE;
   qt_config_data.qt_pos_drift_rate  = DEF_QT_POS_DRIFT_RATE;
   qt_config_data.qt_max_on_duration = DEF_QT_MAX_ON_DURATION;
   qt_config_data.qt_drift_hold_time = DEF_QT_DRIFT_HOLD_TIME;
   qt_config_data.qt_recal_threshold = RECAL_100;  //DEF_QT_RECAL_THRESHOLD ??;
   qt_config_data.qt_pos_recal_delay = 10u;        //DEF_QT_POS_RECAL_DELAY ??;
}
/**
 * @brief configure the individual channel burst length (Based on tuning)
 *
 */
#define DEFAULT_BURST_LENGTH    20u
#define LED_KEY_BURST_LENGTH_1  32u
#define LED_KEY_BURST_LENGTH_2  32u
#define ZERO_BURST_LENGTH       0u
#define ROTOR_BURST_LENGTH_8    40u
#define ROTOR_BURST_LENGTH_9    36u
#define ROTOR_BURST_LENGTH_10   25u
#define ROTOR_BURST_LENGTH_11   32u
static void burst_len_config( void )
{
   /* Used channels */
   qt_burst_lengths[0] = LED_KEY_BURST_LENGTH_1;
   qt_burst_lengths[1] = DEFAULT_BURST_LENGTH;
   qt_burst_lengths[2] = DEFAULT_BURST_LENGTH;
   qt_burst_lengths[3] = LED_KEY_BURST_LENGTH_2;
   
