avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
   qt_burst_lengths[8] = ROTOR_BURST_LENGTH_8;
   qt_burst_lengths[9] = ROTOR_BURST_LENGTH_9;
   qt_burst_lengths[10] = ROTOR_BURST_LENGTH_10;
   qt_burst_lengths[11] = ROTOR_BURST_LENGTH_11;
   qt_burst_lengths[12] = DEFAULT_BURST_LENGTH;
   
   qt_burst_lengths[16] = DEFAULT_BURST_LENGTH;
   qt_burst_lengths[17] = DEFAULT_BURST_LENGTH;
   qt_burst_lengths[18] = DEFAULT_BURST_LENGTH;
   qt_burst_lengths[19] = DEFAULT_BURST_LENGTH;
   
   /* Unused channels */
   qt_burst_lengths[4] = ZERO_BURST_LENGTH;
   qt_burst_lengths[5] = ZERO_BURST_LENGTH;
   qt_burst_lengths[6] = ZERO_BURST_LENGTH;
   qt_burst_lengths[7] = ZERO_BURST_LENGTH;
   qt_burst_lengths[13] = ZERO_BURST_LENGTH;
   qt_burst_lengths[14] = ZERO_BURST_LENGTH;
   qt_burst_lengths[15] = ZERO_BURST_LENGTH;
   qt_burst_lengths[20] = ZERO_BURST_LENGTH;
   qt_burst_lengths[21] = ZERO_BURST_LENGTH;
   qt_burst_lengths[22] = ZERO_BURST_LENGTH;
   qt_burst_lengths[23] = ZERO_BURST_LENGTH;
   qt_burst_lengths[24] = ZERO_BURST_LENGTH;
   qt_burst_lengths[25] = ZERO_BURST_LENGTH;
   qt_burst_lengths[26] = ZERO_BURST_LENGTH;
   qt_burst_lengths[27] = ZERO_BURST_LENGTH;
   qt_burst_lengths[28] = ZERO_BURST_LENGTH; 
   qt_burst_lengths[29] = ZERO_BURST_LENGTH; 
   qt_burst_lengths[30] = ZERO_BURST_LENGTH; 
   qt_burst_lengths[31] = ZERO_BURST_LENGTH; 
}

/**
 * @brief configure timer ISR to fire regularly
 * @ingroup QTouch
 *
 */
static void init_timer_isr( void )
{
   /*  set timer compare value (how often timer ISR will fire) */
   OCR0A = ( TICKS_PER_MS * qt_measurement_period_msec);
   /*  enable timer ISR on compare A */
   TIMSK0 = 0x02u; // Caution
   /*  timer prescaler = system clock / 1024  */
   TCCR0B = 0x05u; // Caution
   /*  timer mode = CTC (count up to compare value, then reset)    */
   TCCR0A = 0x02u; // Caution
}

/**
 * @brief initialise host app, pins, watchdog, etc
 * @ingroup RApp_API
 *
 */
static void init_system( void )
{
   /* run at 8MHz */
   /*
   asm("ldi r16,0x80");
   asm("sts 0x61,r16");
   asm("ldi r16,0x00");
   asm("sts 0x61,r16");
    */
    /* disable pull-ups */
    MCUCR |= (1u << PUD);
    
    /*Configure GPIO for LED Output and buzzer */
    DDRE  |=  (1<<DDE3)|(1<<DDE4)|(1<<DDE6);
}

/**
 * @brief timer 0 compare ISR
 * @ingroup RApp_API
 *
 */
ISR(TIMER0_COMPA_vect)
{
   /* set flag: it's time to measure touch */
   time_to_measure_touch = 1u;
   /* update the current time */
   current_time_ms_touch += qt_measurement_period_msec;
}

/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-RF4CE-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/

 /**
 * @brief  The NLME-RESET.confirm primitive allows the NLME to notify the application of
 * the status of its request to reset the NWK layer.
 *
 * @param Status status of the nwk reset
 */

void nlme_reset_confirm(nwk_enum_t Status)
{

  uint8_t IEEE_Address[8] = {0xbc, 0xbe};
    nlme_set_request(nwkPrivateIeeeAddr, 0, &IEEE_Address[0]);

    if (Status != NWK_SUCCESS)
    {
        while (1)
        {
            // endless while loop!
            indicate_fault_behavior();
        }
    }

    if (node_status == COLD_START)
    {
        pairing_ref = 0xFF;
        nlme_start_request();
    }
    else    // warm start
    {
        pairing_ref = 0;
        node_status = IDLE;
        /* Set power save mode */
        //nlme_rx_enable_request(nwkcMinActivePeriod);
    }
}


/**
 * @brief  The NLME-START.confirm primitive allows the NLME to notify the application of
 * the status of its request to start a network.
 *
 * @param Status status of the nwk start
 */
void nlme_start_confirm(nwk_enum_t Status)
{
    if (Status != NWK_SUCCESS)
    {
        while (1)
        {
            indicate_fault_behavior();
        }
    }

    dev_type_t OrgDevTypeList[1];;
    profile_id_t OrgProfileIdList[1];
    profile_id_t DiscProfileIdList[1];

    OrgDevTypeList[0] = DEV_TYPE_REMOTE_CONTROL;
    OrgProfileIdList[0] = PROFILE_ID_ZRC;
    DiscProfileIdList[0] = PROFILE_ID_ZRC;

    pbp_org_pair_request(APP_CAPABILITIES, OrgDevTypeList, OrgProfileIdList,
                         DEV_TYPE_WILDCARD, NUM_SUPPORTED_PROFILES, DiscProfileIdList);
}


/**
 * @brief Push button pairing confirm; target and controller use
 *
 * The push button pairing confirm is a callback that provides the status of the
 * push pairing request.
 *
 * @param Status        Status of the last pairing transaction
 * @param PairingRef    If pairing was successful, PairingRef contains assigned
 *                      pairing reference.
 */
 void pbp_pair_confirm(nwk_enum_t Status, uint8_t PairingRef)
{
    if (Status != NWK_SUCCESS)
    {
        while(1)
        {
            indicate_fault_behavior();
        }
    }

    pairing_ref = PairingRef;

#ifdef ZRC_CMD_DISCOVERY
    /* Start timer to send the cmd discovery request */
    pal_timer_start(T_LED_TIMER,
                    aplcMinTargetBlackoutPeriod_us,
                    TIMEOUT_RELATIVE,
                    (FUNC_PTR)start_cmd_disc_cb,
                    NULL);
#else
    /* Set power save mode */
    //nlme_rx_enable_request(nwkcMinActivePeriod);
#endif
}

 /**
 * @brief Callback funtion indication that the timer expired for sending the command
 * discovery request.
 * @param callback_parameter    Callback parameter (not used)
 */
#ifdef ZRC_CMD_DISCOVERY
static void start_cmd_disc_cb(void *callback_parameter)
{
    zrc_cmd_disc_request(pairing_ref);

    /* Keep compiler happy */
    UNUSED(callback_parameter);
}
#endif

 /**
 * @brief The command discovery confirm callback provides information about the command
 * discovery reqest.
 *
 * @param Status        Status of the cmd discovery.
 * @param PairingRef    The reference number to paired device in pairing table.
 * @param SupportedCmd  Commands supported on Target.
 */

 
 /**
 * @brief The command discovery confirm callback provides information about the command
 * discovery reqest.
 *
 * @param Status        Status of the cmd discovery.
 * @param PairingRef    The reference number to paired device in pairing table.
 * @param SupportedCmd  Commands supported on Target.
 */
#ifdef ZRC_CMD_DISCOVERY
void zrc_cmd_disc_confirm(nwk_enum_t Status, uint8_t PairingRef, uint8_t *SupportedCmd)
{
    /* Enable transceiver Power Save Mode */
    //nlme_rx_enable_request(nwkcMinActivePeriod);

