avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
    /* Keep compiler happy */
    UNUSED(Status);
    UNUSED(PairingRef);
    UNUSED(SupportedCmd);

/* Process commands from PC */
#ifdef _DEBUG_INTERFACE_
    // QDebug_ProcessCommands();
#endif/* _DEBUG_INTERFACE_*/

#if 0   
    // uint8_t sreg = SREG;                
    // cli();                              
    // CLKPR = 0x80;   /* set CLKPCE */    
    // CLKPR = 0;                          
    // SREG = sreg; 
    // asm("nop");
    // asm("nop");  
    // asm("nop");
    // asm("nop");
     // __enable_interrupt();
#endif
                
    node_status = IDLE;
}
#endif


/**
 * @brief The command discovery indication callback indicates that a command discovery
 * request command was receiced.
 *
 * @param PairingRef    The reference number to paired device in pairing table.
 */

#ifdef ZRC_CMD_DISCOVERY
void zrc_cmd_disc_indication(uint8_t PairingRef)
{
    /* Send back the response */
    uint8_t cec_cmds[32];
    PGM_READ_BLOCK(cec_cmds, supported_cec_cmds, 32);
    zrc_cmd_disc_response(PairingRef, cec_cmds);
}
#endif

 /**
 * @brief The NLME-RX-ENABLE.confirm primitive reports the results of the attempt to
 * enable or disable the receiver.
 *
 * @param Status    Status of the receiver switching.
 */ 
void nlme_rx_enable_confirm(nwk_enum_t Status)
{
    if (Status != NWK_SUCCESS)
    {
        while(1)
        {
            indicate_fault_behavior();
        }
    }

    if (node_status == COLD_START)
    {
        node_status = IDLE;

    }
    else if (node_status == WARM_START)
    {
        node_status = IDLE;

    }

#ifdef _ENABLE_SLEEP_
    if (node_status == TRX_OFF_START)
    {
        node_status = TRX_OFF_CONFIRM; 
    }
    if(node_status == TRX_ON_START)
    {
        node_status = IDLE;
    }
#endif /* _ENABLE_SLEEP_ */    
}

 /**
 * @brief Buzzer initialization
 * @ingroup RApp_API
 */ 
 static void buzzer_init(void)
 {
    DDRE|=(1<<DDE6);
    PORTE &= ~(1<<PORTE6);
 }
 
 /**
 * @brief Buzzer Control. Delay is introduced to make it audible 
 * @ingroup RApp_API
 */ 
static void buzzer_control(void)
{
    uint8_t i =  150u;

       do{
        PORTE  ^= (1<<PORTE6);
        for(int j =0;j<255;j++) asm("nop");
           i--;
       }while (i>0);
    PORTE &= ~(1<<PORTE6);
}


/**
 * @brief Application task and state machine
 * @ingroup RApp_API
 */
static void app_task(void)
{
    uint8_t temp_status1;
    uint8_t temp_status2;

#ifdef _PROX_
    static uint16_t count = 0x1ffu;
#endif /*_PROX_*/
   
    /* Port B is used for X lines. But RF4CE is overwriting whole
                     DDRB, instead of bits it used */
    DDRB |= 0xf0; 

    switch (node_status)
    {
        case IDLE:
        {
            /* If any data to Transmit, send it first. 
               Data to be send will be updated in the delivery variable by the 
               QDebug_SendData() function in QDebug.c 
               Bit-fields of Delivery is checked to see the type of data to be
               Transmitted.            
            */
            if (delivery & (1u<<SUBS_SIGN_ON))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_SIGN_ON);
                Transmit_Sign_On();
                return;
            }
        
            if (delivery & (1u<<SUBS_GLOBAL_CONFIG))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_GLOBAL_CONFIG);
                Transmit_Global_Config();
                return;
            }
        
            if (delivery & (1u<<SUBS_SENSOR_CONFIG))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_SENSOR_CONFIG);
                Transmit_Sensor_Config();
                return;
            }
#ifdef _GENERIC_QDEBUG_            
            if (delivery & (1u<<SUBS_SIGNALS))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_SIGNALS);
                Transmit_Signals();
                return;
            }
            
            if (delivery & (1u<<SUBS_REF))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_REF);
                Transmit_Ref();
                return;
            }
            
            if (delivery & (1u<<SUBS_DELTA))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_DELTA);
                Transmit_Delta();
                return;
            }
            
            if (delivery & (1u<<SUBS_STATES))
            {
                node_status = TRANSMITTING;
                delivery &= ~(1u << SUBS_STATES);
                Transmit_State();
                return;
            }
#endif  /* _GENERIC_QDEBUG_ */              
   
            /* After sending the data, do Touch Measurements */
            if(( time_to_measure_touch ) || (burst_flag))         
            {
                time_to_measure_touch = 0u;
                
                /* Read Tilt position from accelero meter */
#ifdef _ACCELERO_
                accelero_read (KXTF9_INT_SRC_REG2, &memory_map.body.accelero_status);
                accelero_read (KXTF9_INT_REL, &memory_map.body.accelero_status);
                accelero_read (KXTF9_TILT_POS_CUR, &memory_map.body.accelero_status);
#endif /*_ACCELERO_ */

                /* Measure touch once */
                status_flag = qt_measure_sensors(current_time_ms_touch );
                burst_flag = status_flag & QTLIB_BURST_AGAIN;

                /* check whether the sensor status is changed from previous status */
                temp_status1 = memory_map.body.sensor_status[0] ^ qt_measure_data.qt_touch_status.sensor_states[0];
                temp_status2 = memory_map.body.sensor_status[1] ^ qt_measure_data.qt_touch_status.sensor_states[1];
                temp_status2 &= 0x03; 
                
                /* If Sensor status is changed, do not sleep, but buzz  */
                if(temp_status1|temp_status2)
                {
#ifdef _ENABLE_SLEEP_
                    enable_sleep_counter=0;
                    buzzer_control();
#endif /* _ENABLE_SLEEP_ */                    
                    

                    /* Store back the current sensor status */ 
                    temp_status1 = 0;
                    temp_status2 = 0;
                    memory_map.body.sensor_status[0] = qt_measure_data.qt_touch_status.sensor_states[0];
                    memory_map.body.sensor_status[1] = qt_measure_data.qt_touch_status.sensor_states[1];
                    memory_map.body.wheel_position = qt_measure_data.qt_touch_status.rotor_slider_values[0];
                
#ifdef _PROX_
                    if((PIND & (1 << PIND2)) && prox_int_flag) count--;
                    if(count == 0 )
                    {
                        count = 0x10u;
                        PORTE &= ~((1<<PE3)|(1<<PE4));
                        prox_int_flag = 0;
                    }
#endif  /* _PROX_ */
                } 

