avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
#ifdef _ENABLE_SLEEP_
                else  if (allow_to_sleep)
                {
                    enable_sleep_counter++;
                    if(enable_sleep_counter > AVR477_ACTIVE_DURATION_IN_QT_MEASURE_PERIOD) 
                    {
                        node_status = TRX_OFF_START;
                        nlme_rx_enable_request(RX_DURATION_OFF);
                        return;
                    }
                }
                else
                {
                    enable_sleep_counter = 0;
                }
#endif /* _ENABLE_SLEEP_ */                
                

                /* send debug data */ 
                #ifdef _DEBUG_INTERFACE_
                    QDebug_SendData(status_flag);
                #endif/* _DEBUG_INTERFACE_*/

                /* Time-critical host application code goes here */
            } 
        /* Non time-critical application code goes here */
        break;
        }

#ifdef _ENABLE_SLEEP_
        
        case TRX_OFF_CONFIRM:
        {
            if (nwk_stack_idle())
            {
                prox_on(); 
                enable_sleep_counter = 0;
                                    
                pal_timer_start(T_LED_TIMER,
                                AVR477_SLEEP_DURATION_IN_US,
                                TIMEOUT_RELATIVE,
                                (FUNC_PTR)start_awake_timer_cb,
                                NULL);
                delivery = 0;
                accelero_off();     
                sleep_led_control();
  
#if defined( __GNUC__ ) 
                pal_sleep_mode(SLEEP_MODE_PWR_SAVE);
#elif defined ( __ICCAVR__ )
                /* Clear interrupt flag */
                EIFR = (1 << INTF5);
                /* Enable external interrupt */
                EIMSK |= (1 << INT5);
                WDT_DISABLE();
                SET_SLEEP_MODE(SLEEP_MODE_PWR_SAVE);
                SLEEP_MODE();
                WDT_RESET();
                WDT_SYSTEM_RESET_MODE(WDT_TO_8S);
#endif
                accelero_init();
                prox_off();
                node_status = TRX_ON_START;
                nlme_rx_enable_request(RX_DURATION_INFINITY);
            }
            break;
        }
#endif /* _ENABLE_SLEEP_ */

        case RESET:
        {
#ifdef _ACCELERO_
            uint8_t accelero_tilt_status;
            accelero_read (KXTF9_TILT_POS_CUR, &accelero_tilt_status);
            /* If Accelero is in Vertical Position, then do the cold reset */
            if (accelero_tilt_status == CTRL_REG2_UPM || accelero_tilt_status == CTRL_REG2_DOM)
#endif /*_ACCELERO_ */
            {
                /* Cold start on power up without button press*/
                pal_timer_stop(T_LED_TIMER);
                node_status = COLD_START;
                nlme_reset_request(true);
                buzzer_control();
            }                  
        break; 
        }

        default:
            break;
    } 
} /* app_task*/



/**
 * @brief ZRC command confirm
 *
 * The ZRC comand confirm callback provides information about the status of the
 * last command request/transmission.
 *
 * @param Status        NWK_SUCCESS if transmission was successful
 * @param PairingRef    Pairing reference
 * @param RcCmd         Sent RC command
 */
void zrc_cmd_confirm(nwk_enum_t Status, uint8_t PairingRef, cec_code_t RcCmd)
{
    node_status = IDLE;
    TX_index = 4;
    
    if (Status != NWK_SUCCESS)
    {
        led1_toggle();
    }
    /* Keep compiler happy. */
    UNUSED(PairingRef);
    UNUSED(RcCmd);
}



/**
 * @brief Vendor data confirm.
 *
 * @param Status       Status of the vendor-data-request
 * @param PairingRef   The pairing reference
 */
#ifndef RF4CE_TARGET
void vendor_data_confirm(nwk_enum_t Status, uint8_t PairingRef)
{
    node_status = IDLE;
    TX_index = 4;
    
    if (Status != NWK_SUCCESS)
    {
        led1_toggle();
    }
    /* Keep compiler happy */
    UNUSED(Status);
    UNUSED(PairingRef);
}
#endif

/**
 * @brief The NLDE-DATA.confirm primitive is generated by the NWK layer entity in
 * response to an NLDE-DATA.request primitive.
 *
 * @param Status        NWK_SUCCESS if transmission was successful
 * @param PairingRef    Pairing reference
 * @param ProfileId     Profile Id
 */
void nlde_data_confirm(nwk_enum_t Status, uint8_t PairingRef, profile_id_t ProfileId)
{
    node_status = IDLE;

    if (Status != NWK_SUCCESS)
    {
        indicate_fault_behavior();
    }

    /* Keep compiler happy. */
    UNUSED(PairingRef);
    UNUSED(ProfileId);
}



/* --- Helper functions ---------------------------------------------------- */


/**
 * @brief Extended blocking delay
 * @ingroup RApp_API
 * @param delay_ms Delay value in ms
 */
static void extended_delay_ms(uint16_t delay_ms)
{
    uint16_t i;
    uint16_t timer_delay;

    timer_delay = delay_ms / 50;
    for (i = 0; i < timer_delay; i++)
    {
        pal_timer_delay(50000);
    }
}
 

/**
 * @brief Indicating malfunction
 * @ingroup RApp_API
 */
static void indicate_fault_behavior(void)
{
    for (uint8_t i = 0; i < 5; i++)
    {
        led0_on();
        led1_on();
        extended_delay_ms(50);
        led0_off();
        led1_off();
        extended_delay_ms(50);
    }
    led1_off();
    led0_off();
}

/**
 * @brief led0 on
 * @ingroup RApp_API
 */
static inline void led0_on(void)
{
    PORTE|=(1<<PE3);
}

/**
 * @brief led1 on
 * @ingroup RApp_API
 */
static inline void led1_on(void)
{
    PORTE|=(1<<PE4);
}

/**
 * @brief  led0 off
 * @ingroup RApp_API
 */
static inline void led0_off(void)
{
    PORTE&=~(1<<PE3);
}

/**
 * @brief  led1 off
 * @ingroup RApp_API
 */
static inline void led1_off(void)
{
    PORTE&=~(1<<PE4);
}

/**
 * @brief led0 Toggle
 * @ingroup RApp_API
 */
static inline void led0_toggle(void)
{
    PORTE ^= (1<<PE3);
}

/**
 * @brief Led1 Toggle
 * @ingroup RApp_API
 */
static inline void led1_toggle(void)
{
    PORTE ^= (1<<PE4);
}

/**
 * @brief Vendor-spefic callback; handles reaction to incoming alive request
 */
void vendor_app_alive_req(void)
{
/* Variant to demonstrate FOTA featue */
#if 1

#else

#endif
}
/* --- Unused functions ---------------------------------------------------- */

/**
 * @brief The NLME-SET.confirm primitive allows the NLME to notify the application of the
 * status of its request to change the value of a NIB attribute.
 *
 * @param Status            NWK_SUCCESS if value is set correctly
 * @param NIBAttribute      Attribute Id
 * @param NIBAttributeIndex Attribute Index
 */
void nlme_set_confirm(nwk_enum_t Status, nib_attribute_t NIBAttribute, uint8_t NIBAttributeIndex)
{
    /* Keep compiler happy */
    UNUSED(Status);
    UNUSED(NIBAttribute);
    UNUSED(NIBAttributeIndex);
}

/**
 * @brief  The NLME-GET.confirm primitive allows the NLME to notify the application of the
 * status of its request for the value of a NIB attribute.
 *
 * @param Status            NWK_SUCCESS if value is get correctly
 * @param NIBAttribute      Attribute Id
 * @param NIBAttributeValue Pointer where value of attribute is stored.
 * 
 */
void nlme_get_confirm(nwk_enum_t Status, nib_attribute_t NIBAttribute,
                      uint8_t NIBAttributeIndex, void *NIBAttributeValue)
{
    /* Keep compiler happy */
    UNUSED(Status);
    UNUSED(NIBAttribute);
    UNUSED(NIBAttributeIndex);
    UNUSED(NIBAttributeValue);
}

/**
 * @brief The NLME-UNPAIR.indication primitive allows the NLME to notify the application
 * of the removal of a pairing link by another device.
 *
 * @param PairingRef  Pairing Reference of the device to be unpaired
 */
void nlme_unpair_indication(uint8_t PairingRef)
{
    /* Keep compiler happy */
    UNUSED(PairingRef);
}

/**
 * @brief The NLME-UNPAIR.confirm primitive allows the NLME to notify the application of
 * the status of its request to remove a pair with another device.
 *
 * @param Status      Staus of unpair confirm
 * @param PairingRef  Pairing Reference of the device to be unpaired
 */
void nlme_unpair_confirm(uint8_t Status, uint8_t PairingRef)
{
    /* Keep compiler happy */
    UNUSED(Status);
    UNUSED(PairingRef);
}

/**
 * @brief The NLME-UPDATE-KEY.confirm primitive allows the NLME to notify the
 * application of the status of its request to change the security link key of
 * a pairing table entry.
 *
 * @param Status      Staus of unpair confirm
 * @param PairingRef  Pairing Reference of the device
 */
void nlme_update_key_confirm(nwk_enum_t Status, uint8_t PairingRef)
{
    /* Keep compiler happy */
    UNUSED(Status);
    UNUSED(PairingRef);
}

/**
 * @brief The callback function for the warm-reset timeout
 * @ingroup RApp_API
 * @param callback_parameter      Callback parameter (unused)
 */
#ifdef _ENABLE_WARM_RESET_
static void start_warm_reset_cb(void *callback_parameter)
{
    /* Warm start */
    node_status = WARM_START;
    pal_ps_get(INTERN_EEPROM, EE_QDEBUG_OFFSET, 2, &qgSubsOnce);
    pal_ps_get(INTERN_EEPROM, EE_QDEBUG_OFFSET + 2, 2, &qgSubsChange);
    pal_ps_get(INTERN_EEPROM, EE_QDEBUG_OFFSET + 4, 2, &qgSubsAllways);

