avrxml/asf/thirdparty/atmel_rf4ce/examples/atmega128rfa1_avr477_remote/main.c
#ifdef _ENABLE_SLEEP_   
    pal_ps_get(INTERN_EEPROM, EE_QDEBUG_OFFSET + 6, 2, &allow_to_sleep);
#endif /* _ENABLE_SLEEP_ */
    
    nlme_reset_request(false);

    buzzer_control();

    /* Keep compiler happy */
    UNUSED(callback_parameter);
}
#endif /* _ENABLE_WARM_RESET_ */


/**
 * @brief The callback function for the awake timer after the sleep period is over.
 * @ingroup RApp_API
 * @param callback_parameter      Callback parameter (unused)
 */
#ifdef _ENABLE_SLEEP_
static void start_awake_timer_cb(void *callback_parameter)
{
    /* Keep compiler happy */
    UNUSED(callback_parameter);
}
#endif /* _ENABLE_SLEEP_ */



/**
 * @brief  Configure the sensors, assign the channel number, aks_group, hysteresis.
 * @ingroup QTouch
 */
void config_sensors(void)
{
    qt_enable_key(CHANNEL_19, AKS_GROUP_1, 20u, HYST_6_25 );   /* Sensor 0 */
    qt_enable_key(CHANNEL_3, AKS_GROUP_1, 33u, HYST_6_25 );    /* Sensor 1 */
    qt_enable_key(CHANNEL_0, AKS_GROUP_1, 28u, HYST_6_25 );    /* Sensor 2 */
    qt_enable_key(CHANNEL_17, AKS_GROUP_1, 22u, HYST_6_25 );   /* Sensor 3 */
    qt_enable_key(CHANNEL_18, AKS_GROUP_1, 20u, HYST_6_25 );   /* Sensor 4 */
    qt_enable_key(CHANNEL_2, AKS_GROUP_1, 23u, HYST_6_25 );    /* Sensor 5 */
    qt_enable_key(CHANNEL_1, AKS_GROUP_1, 22u, HYST_6_25 );    /* Sensor 6 */
    qt_enable_key(CHANNEL_16, AKS_GROUP_1, 16u, HYST_6_25 );   /* Sensor 7 */
    qt_enable_rotor(CHANNEL_8, CHANNEL_11, AKS_GROUP_1, 55u, HYST_25, RES_8_BIT, 3u ); /* Sensor 8 */
    qt_enable_key(CHANNEL_12, AKS_GROUP_1, 20u, HYST_6_25 );   /* Sensor 9 */

#ifdef _ACCELERO_
#ifdef _DEBUG_INTERFACE_ 
   /* Enable 6 dummy keys to simulate Accelero meter, just for demo purpose */
    qt_enable_key(CHANNEL_4,  AKS_GROUP_2,10u,HYST_6_25);  /* Accelero FU */
    qt_enable_key(CHANNEL_20, AKS_GROUP_2,10u,HYST_6_25); /* Accelero FD */
    qt_enable_key(CHANNEL_24, AKS_GROUP_2,10u,HYST_6_25); /* Accelero UP */
    qt_enable_key(CHANNEL_25, AKS_GROUP_2,10u,HYST_6_25); /* Accelero DO */
    qt_enable_key(CHANNEL_26, AKS_GROUP_2,10u,HYST_6_25); /* Accelero RI */
    qt_enable_key(CHANNEL_27, AKS_GROUP_2,10u,HYST_6_25); /* Accelero LE */
#endif/* _DEBUG_INTERFACE_*/
#endif /*_ACCELERO_ */
}

/* EOF */
